# Pandas - A widely used open source python library used in data analysis.

import pandas as pd #import pandas library

### Two Main Data Types
- Series
- Data Frame

In [8]:
# Series = one-dimensional
series = pd.Series(["BMW", "Toyota","Hero", "Honda"])

In [7]:
series

0       BMW
1    Toyota
2      Hero
3     Honda
dtype: object

In [16]:
colours = pd.Series(["Red","Blue","Orange", "Black"])

In [17]:
colours

0       Red
1      Blue
2    Orange
3     Black
dtype: object

In [18]:
# DataFrame = two-dimensional
car_data = pd.DataFrame({"Car Manufacturer": series, "Colour": colours})
car_data

  Car Manufacturer  Colour
0              BMW     Red
1           Toyota    Blue
2             Hero  Orange
3            Honda   Black

In [21]:
# Import data
car_sales = pd.read_csv("data/car-sales.csv") #read_csv function import and read the csv file.

In [22]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [26]:
# Exporting a dataframe
car_sales.to_csv("exported_car_sales.csv", index=False)

In [28]:
exported_car_sales = pd.read_csv("exported_car_sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe Data

Attribute - is like which give some information. 
Ex. car_sales.dtypes

Function - built in function to do specific work.
Ex. car_sales.to_csv()

main difference between both of them attribute dont have brackets (), while functions have.

## Attribute

In [32]:
# Attributes
car_sales.dtypes #return the data types of columns

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [30]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [33]:
car_columns = car_sales.columns #return columns of table.
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [34]:
car_sales.index # return index information of  data.

RangeIndex(start=0, stop=10, step=1)

## Functions

In [35]:
car_sales.describe() ## describe() - gives us some statistical information about the data.

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [37]:
car_sales.info() # info() - give information about the data like mixture of columns and dtypes gives us.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [40]:
car_prices = pd.Series([3000,1500,111250])
car_prices.mean()

np.float64(38583.333333333336)

In [41]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [42]:
car_sales["Price"].sum()

'$4,000.00$5,000.00$7,000.00$22,000.00$3,500.00$4,500.00$7,500.00$7,000.00$6,250.00$9,700.00'

In [43]:
len(car_sales)

10

## Viewing and Selecting data

In [45]:
car_sales.head() ## head() - gives a quick snapshot of data by returning top 5 enteries by default.

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [46]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [47]:
car_sales.tail() ## tail() - gives a quick snapshot of data by returning bottom 5 enteries by default.

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [48]:
car_sales.tail(7)

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00